/*----------------------------------------------------------------------------------
	Project Name: Smart HYGAS
	Compiler & Virtual Machine : SMART 1.0.0
	Copyright(c) 2014 Value CMD Co., Ltd
	----------	------		------------------------------------------------------
	2014.10.01	dkjung		v 3.0.1		: Create 스마트폰 포팅
----------------------------------------------------------------------------------*/

#ifndef __DEFTYPE_H__
#define	__DEFTYPE_H__

// 주의!!!!!!!!!!!!!!!!!!!!!!
// dkjung 2003-07-16
// 항상 최종본을 만들 경우 이 곳을 확인 하시오.

// 전체 영역에 적용되는 모든 형태의 타입 정의

//-----------------------------------------------------------------------------
//	0.	릴리즈 버전 컴파일 
//	1.	버전 타입을 반드시 확인
//-----------------------------------------------------------------------------
	// Version Control dkjung 2003-6-15
	//#define VER_RELEASE			// 최종 릴리즈 버전
 
	// Server Type Control Sanghyun Lee 2017-07-05
	//#define TYPE_BASIC			// 서버 타입 설정 (define : 0.0.1 / undef : 0.0.2 )
	
	#ifdef VER_RELEASE
		#undef VER_DEBUG		// 릴리즈 모드를 우선으로 선택한다.
	#else
		#define VER_DEBUG		// 테스트, 디버그 모드
	#endif // VER_RELEASE
	
//-----------------------------------------------------------------------------
//	1.	디버깅 세션 컴파일 
//-----------------------------------------------------------------------------
	//#define _TRACE			// _TRACE 매크로를 사용할 경우.
	
//-----------------------------------------------------------------------------
//	2.	옵션 컴파일 
//-----------------------------------------------------------------------------


#endif // _DEFTYPE_H_
